
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>gmp模型 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="README.md" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../HOME.html">
            
                <a href="../HOME.html">
            
                    
                    主页
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="README.md">
            
                <span>
            
                    
                    golang
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="gmp.html">
            
                <a href="gmp.html">
            
                    
                    gmp模型
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >gmp模型</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h4 id="&#x4E86;&#x89E3;go&#x7684;gmp&#x6A21;&#x578B;">&#x4E86;&#x89E3;Go&#x7684;GMP&#x6A21;&#x578B;</h4>
<hr>
<h5 id="&#x524D;&#x63D0;">&#x524D;&#x63D0;</h5>
<p>&#x60F3;&#x8981;&#x4E86;&#x89E3;go&#x7684;GMP&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x9700;&#x8981;&#x5148;&#x5F04;&#x6E05;&#x695A;&#x4E00;&#x4E9B;&#x57FA;&#x7840;&#x6982;&#x5FF5;&#x3002;</p>
<ul>
<li><p>&#x8FDB;&#x7A0B;</p>
<p>What?&#x2014;&#x2014;&#x8FDB;&#x7A0B;&#xFF08;Process&#xFF09;&#x662F;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x7A0B;&#x5E8F;&#x5173;&#x4E8E;&#x67D0;&#x6570;&#x636E;&#x96C6;&#x5408;&#x4E0A;&#x7684;&#x4E00;&#x6B21;<strong>&#x8FD0;&#x884C;&#x6D3B;&#x52A8;</strong>&#xFF0C;&#x662F;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;<strong>&#x8D44;&#x6E90;&#x5206;&#x914D;</strong>&#x548C;<strong>&#x8C03;&#x5EA6;</strong>&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#xFF0C;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7ED3;&#x6784;&#x7684;&#x57FA;&#x7840;&#x3002;&#x6240;&#x6709;&#x4E0E;&#x8BE5;&#x8FDB;&#x7A0B;&#x6709;&#x5173;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x90FD;&#x88AB;&#x8BB0;&#x5F55;&#x5728;&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x5757;PCB&#xFF08;Processing Control Block&#xFF09;&#x4E2D;&#x3002;&#x4EE5;&#x8868;&#x793A;&#x8BE5;&#x8FDB;&#x7A0B;&#x62E5;&#x6709;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x6216;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x3002;</p>
<p>PCB&#x662F;&#x7CFB;&#x7EDF;&#x611F;&#x77E5;&#x8FDB;&#x7A0B;&#x5B58;&#x5728;&#x7684;&#x552F;&#x4E00;&#x6807;&#x5FD7;&#xFF0C;&#x7CFB;&#x7EDF;&#x7528;&#x5B83;&#x6765;&#x8BB0;&#x5F55;&#x8FDB;&#x7A0B;&#x7684;&#x5916;&#x90E8;&#x7279;&#x5F81;&#xFF0C;&#x63CF;&#x8FF0;&#x8FDB;&#x7A0B;&#x7684;&#x8FD0;&#x52A8;&#x53D8;&#x5316;&#x8FC7;&#x7A0B;&#x3002;&#x901A;&#x5E38;&#x8BB0;&#x8F7D;&#x8FDB;&#x7A0B;&#x4E4B;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;
&#xFF08;1&#xFF09;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF1A;&#x63A5;&#x7740;&#x8981;&#x8FD0;&#x884C;&#x7684;&#x6307;&#x4EE4;&#x5730;&#x5740;&#x3002;
&#xFF08;2&#xFF09;&#x8FDB;&#x7A0B;&#x72B6;&#x6001;&#xFF1A;&#x53EF;&#x4EE5;&#x662F;new&#x3001;ready&#x3001;running&#x3001;waiting&#x6216; blocked&#x7B49;&#x3002;
&#xFF08;3&#xFF09;CPU&#x6682;&#x5B58;&#x5668;&#xFF1A;&#x5982;&#x7D2F;&#x52A0;&#x5668;&#x3001;&#x7D22;&#x5F15;&#x6682;&#x5B58;&#x5668;&#xFF08;Index register&#xFF09;&#x3001;&#x5806;&#x6808;&#x6307;&#x9488;&#x4EE5;&#x53CA;&#x4E00;&#x822C;&#x7528;&#x9014;&#x6682;&#x5B58;&#x5668;&#x3001;&#x72B6;&#x51B5;&#x4EE3;&#x7801;&#x7B49;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x9014;&#x5728;&#x4E8E;&#x4E2D;&#x65AD;&#x65F6;&#x6682;&#x65F6;&#x5B58;&#x50A8;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x4FBF;&#x7A0D;&#x540E;&#x7EE7;&#x7EED;&#x5229;&#x7528;&#xFF1B;&#x5176;&#x6570;&#x91CF;&#x53CA;&#x7C7B;&#x56E0;&#x7535;&#x8111;&#x67B6;&#x6784;&#x6709;&#x6240;&#x5DEE;&#x5F02;&#x3002;
&#xFF08;4&#xFF09;CPU&#x6392;&#x73ED;&#x6CD5;&#xFF1A;&#x4F18;&#x5148;&#x7EA7;&#x3001;&#x6392;&#x73ED;&#x961F;&#x5217;&#x7B49;&#x6307;&#x9488;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x53C2;&#x6570;&#x3002;
&#xFF08;5&#xFF09;&#x5B58;&#x50A8;&#x5668;&#x7BA1;&#x7406;&#xFF1A;&#x5982;&#x6807;&#x7B7E;&#x9875;&#x8868;&#x7B49;&#x3002;
&#xFF08;6&#xFF09;&#x4F1A;&#x8BA1;&#x4FE1;&#x606F;&#xFF1A;&#x5982;CPU&#x4E0E;&#x5B9E;&#x9645;&#x65F6;&#x95F4;&#x4E4B;&#x4F7F;&#x7528;&#x6570;&#x91CF;&#x3001;&#x65F6;&#x9650;&#x3001;&#x8D26;&#x53F7;&#x3001;&#x5DE5;&#x4F5C;&#x6216;&#x8FDB;&#x7A0B;&#x53F7;&#x7801;&#x3002;
&#xFF08;7&#xFF09;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x72B6;&#x6001;&#xFF1A;&#x914D;&#x7F6E;&#x8FDB;&#x7A0B;&#x4F7F;&#x7528;I/O&#x8BBE;&#x5907;&#xFF0C;&#x5982;&#x78C1;&#x5E26;&#x673A;&#x3002;</p>
<p>&#x5B83;&#x53EF;&#x4EE5;&#x7533;&#x8BF7;&#x548C;&#x62E5;&#x6709;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x52A8;&#x6001;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x6D3B;&#x52A8;&#x7684;<strong>&#x5B9E;&#x4F53;</strong>&#x3002;&#x4E0E;&#x7A0B;&#x5E8F;&#x5BF9;&#x6BD4;&#xFF0C;&#x7A0B;&#x5E8F;&#x662F;&#x6307;&#x4EE4;&#x548C;&#x6570;&#x636E;&#x7684;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#xFF0C;&#x5176;&#x672C;&#x8EAB;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8FD0;&#x884C;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x7684;&#x6982;&#x5FF5;&#xFF1B;&#x5728;&#x4F20;&#x7EDF;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x5E76;&#x4E0D;&#x80FD;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#xFF0C;&#x4F5C;&#x4E3A;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x548C;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#x7684;&#x57FA;&#x672C;&#x5355;&#x5143;&#x90FD;&#x662F;&#x8FDB;&#x7A0B;&#x3002;&#x8FDB;&#x7A0B;&#x4E5F;&#x662F;&#x62A2;&#x5360;&#x5904;&#x7406;&#x673A;&#x7684;&#x8C03;&#x5EA6;&#x5355;&#x4F4D;&#x3002;</p>
<p>&#x8FDB;&#x884C;&#x8FDB;&#x7A0B;&#x5207;&#x6362;&#x5C31;&#x662F;&#x4ECE;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x4E2D;&#x6536;&#x56DE;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x4F7F;&#x5F85;&#x8FD0;&#x884C;&#x8FDB;&#x7A0B;&#x6765;&#x5360;&#x7528;&#x5904;&#x7406;&#x5668;&#x3002;&#x5728;&#x5207;&#x6362;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;<strong>&#x5B58;&#x50A8;&#x5728;&#x5904;&#x7406;&#x5668;&#x5404;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x7684;&#x4E2D;&#x95F4;&#x6570;&#x636E;</strong>&#x53EB;&#x505A;&#x8FDB;&#x7A0B;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x6240;&#x4EE5;&#x8FDB;&#x7A0B;&#x7684; &#x5207;&#x6362;&#x5B9E;&#x8D28;&#x4E0A;&#x5C31;&#x662F;&#x88AB;&#x4E2D;&#x6B62;&#x8FD0;&#x884C;&#x8FDB;&#x7A0B;&#x4E0E;&#x5F85;&#x8FD0;&#x884C;&#x8FDB;&#x7A0B;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x5207;&#x6362;&#x3002;&#x5728;&#x8FDB;&#x7A0B;&#x672A;&#x5360;&#x7528;&#x5904;&#x7406;&#x5668;&#x65F6;&#xFF0C;&#x8FDB;&#x7A0B; &#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x662F;&#x5B58;&#x50A8;&#x5728;&#x8FDB;&#x7A0B;&#x7684;<strong>&#x79C1;&#x6709;&#x5806;&#x6808;</strong>&#x4E2D;&#x7684;&#x3002;</p>
<p>&#x8FD0;&#x884C;&#x4E2D;&#x7684;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x4E09;&#x79CD;&#x57FA;&#x672C;&#x72B6;&#x6001;&#xFF1A;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#xFF08;Ready&#xFF09;&#x3001;&#x8FD0;&#x884C;&#x72B6;&#x6001;(Running)&#x3001;&#x963B;&#x585E;&#x72B6;&#x6001;(Blocked)&#x3002;</p>
</li>
<li><p>&#x7EBF;&#x7A0B;</p>
<p>What?&#x2014;&#x2014;&#x7EBF;&#x7A0B;&#xFF08;Threads&#xFF09;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;<strong>&#x8FDB;&#x884C;&#x8FD0;&#x7B97;&#x8C03;&#x5EA6;</strong>&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#x3002;&#x5B83;&#x88AB;&#x5305;&#x542B;&#x5728;&#x8FDB;&#x7A0B;&#x4E4B;&#x4E2D;&#xFF0C;&#x662F;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x5B9E;&#x9645;&#x8FD0;&#x4F5C;&#x5355;&#x4F4D;&#x3002;&#x4E00;&#x6761;&#x7EBF;&#x7A0B;&#x6307;&#x7684;&#x662F;&#x8FDB;&#x7A0B;&#x4E2D;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x987A;&#x5E8F;&#x7684;&#x63A7;&#x5236;&#x6D41;&#xFF0C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x53EF;&#x4EE5;&#x5E76;&#x53D1;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x6BCF;&#x6761;&#x7EBF;&#x7A0B;&#x5E76;&#x884C;&#x6267;&#x884C;&#x4E0D;&#x540C;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x662F;&#x4F5C;&#x4E3A;&#x5229;&#x7528;CPU&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#xFF0C;&#x662F;&#x82B1;&#x8D39;&#x6700;&#x5C0F;&#x5F00;&#x9500;&#x7684;&#x5B9E;&#x4F53;&#x3002;</p>
<p>&#x5728;Unix System V&#x53CA;SunOS&#x4E2D;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x8F7B;&#x91CF;&#x8FDB;&#x7A0B;&#xFF08;lightweight processes&#xFF09;&#xFF0C;&#x4F46;&#x8F7B;&#x91CF;&#x8FDB;&#x7A0B;&#x66F4;&#x591A;&#x6307;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#xFF08;kernel thread&#xFF09;&#xFF0C;&#x800C;&#x628A;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#xFF08;user thread&#xFF09;&#x79F0;&#x4E3A;&#x7EBF;&#x7A0B;&#x3002;</p>
<p>&#x540C;&#x4E00;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x591A;&#x6761;&#x7EBF;&#x7A0B;&#x5C06;&#x5171;&#x4EAB;&#x8BE5;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x5168;&#x90E8;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#xFF0C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x6709;&#x5F88;&#x591A;&#x7EBF;&#x7A0B;&#xFF0C;&#x6BCF;&#x6761;&#x7EBF;&#x7A0B;&#x5E76;&#x884C;&#x6267;&#x884C;&#x4E0D;&#x540C;&#x7684;&#x4EFB;&#x52A1;&#x3002;</p>
<p>Why?&#x2014;&#x2014;&#x5F15;&#x5165;&#x7EBF;&#x7A0B;&#x7684;&#x539F;&#x56E0;&#xFF1A;&#x4E00;&#x662F;&#x7531;&#x4E8E;&#x8FDB;&#x7A0B;&#x662F;&#x8D44;&#x6E90;&#x62E5;&#x6709;&#x8005;&#xFF0C;&#x521B;&#x5EFA;&#x3001;&#x64A4;&#x6D88;&#x4E0E;&#x5207;&#x6362;&#x5B58;&#x5728;&#x8F83;&#x5927;&#x7684;&#x65F6;&#x7A7A;&#x5F00;&#x9500;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x5F15;&#x5165;&#x8F7B;&#x578B;&#x8FDB;&#x7A0B;&#xFF1B;&#x4E8C;&#x662F;&#x7531;&#x4E8E;&#x5BF9;&#x79F0;&#x591A;&#x5904;&#x7406;&#x673A;&#xFF08;Symmetrical Multi-Processing&#x7B80;&#x79F0;SMP&#xFF09;&#x51FA;&#x73B0;&#xFF0C;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;&#x591A;&#x4E2A;&#x8FD0;&#x884C;&#x5355;&#x4F4D;&#xFF0C;&#x800C;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x5E76;&#x884C;&#x5F00;&#x9500;&#x8FC7;&#x5927;&#x3002;</p>
<p>&#x7EBF;&#x7A0B;&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x5C5E;&#x6027;&#xFF1A;&#x8F7B;&#x578B;&#x5B9E;&#x4F53;&#x3001;&#x72EC;&#x7ACB;&#x8C03;&#x5EA6;&#x548C;&#x5206;&#x6D3E;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#x3001;&#x53EF;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x3001;&#x5171;&#x4EAB;&#x8FDB;&#x7A0B;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x7EBF;&#x7A0B;&#x7684;&#x5B9E;&#x4F53;&#x5305;&#x62EC;&#x7A0B;&#x5E8F;&#x3001;&#x6570;&#x636E;&#x548C;TCB&#x3002;&#x7EBF;&#x7A0B;&#x662F;&#x52A8;&#x6001;&#x6982;&#x5FF5;&#xFF0C;&#x5B83;&#x7684;&#x52A8;&#x6001;&#x7279;&#x6027;&#x7531;&#x7EBF;&#x7A0B;&#x63A7;&#x5236;&#x5757;TCB&#xFF08;Thread Control Block&#xFF09;&#x63CF;&#x8FF0;&#x3002;</p>
<p>TCB&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x4FE1;&#x606F;&#xFF1A;
&#xFF08;1&#xFF09;&#x7EBF;&#x7A0B;&#x72B6;&#x6001;&#x3002;
&#xFF08;2&#xFF09;&#x5F53;&#x7EBF;&#x7A0B;&#x4E0D;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x88AB;&#x4FDD;&#x5B58;&#x7684;&#x73B0;&#x573A;&#x8D44;&#x6E90;&#x3002;
&#xFF08;3&#xFF09;&#x4E00;&#x7EC4;&#x6267;&#x884C;&#x5806;&#x6808;&#x3002;
&#xFF08;4&#xFF09;&#x5B58;&#x653E;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E3B;&#x5B58;&#x533A;&#x3002;
&#xFF08;5&#xFF09;&#x8BBF;&#x95EE;&#x540C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x4E3B;&#x5B58;&#x548C;&#x5176;&#x5B83;&#x8D44;&#x6E90;&#x3002;</p>
</li>
<li><p>&#x534F;&#x7A0B;&#xFF08;&#x4EE5;goroutine&#x4E3A;&#x4F8B;&#x5B50;&#xFF09;</p>
<p>&#x8F7B;&#x91CF;&#x7EA7;&#x7EBF;&#x7A0B;&#xFF08;goroutine&#xFF09;&#x662F;Go&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x7684;&#x4E00;&#x79CD;&#x7528;&#x6237;&#x6001;&#x7EBF;&#x7A0B;&#xFF0C;&#x6709;&#x65F6;&#x6211;&#x4EEC;&#x4E5F;&#x79F0;&#x4E4B;&#x4E3A;&#x534F;&#x7A0B;&#x3002;&#x4F46;&#x662F;&#x5B83;&#x6BD4;&#x7EBF;&#x7A0B;&#x66F4;&#x5C0F;&#xFF0C;&#x5341;&#x51E0;&#x4E2A;goroutine&#x53EF;&#x80FD;&#x4F53;&#x73B0;&#x5728;&#x5E95;&#x5C42;&#x5C31;&#x662F;&#x4E94;&#x516D;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;Go&#x8BED;&#x8A00;&#x5185;&#x90E8;&#x5B9E;&#x73B0;&#x4E86;&#x8FD9;&#x4E9B;goroutine&#x4E4B;&#x95F4;&#x7684;&#x5185;&#x5B58;&#x5171;&#x4EAB;&#x3002;&#x6267;&#x884C;goroutine&#x53EA;&#x9700;&#x6781;&#x5C11;&#x7684;&#x6808;&#x5185;&#x5B58;(&#x5927;&#x6982;&#x662F;4~5KB)&#xFF0C;&#x5F53;&#x7136;&#x4F1A;&#x6839;&#x636E;&#x76F8;&#x5E94;&#x7684;&#x6570;&#x636E;&#x4F38;&#x7F29;&#x3002;&#x4E5F;&#x6B63;&#x56E0;&#x4E3A;&#x5982;&#x6B64;&#xFF0C;&#x53EF;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x4E2A;&#x5E76;&#x53D1;&#x4EFB;&#x52A1;&#x3002;goroutine&#x6BD4;thread&#x66F4;&#x6613;&#x7528;&#x3001;&#x66F4;&#x9AD8;&#x6548;&#x3001;&#x66F4;&#x8F7B;&#x4FBF;</p>
<p>&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#xFF0C;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x5207;&#x6362;&#x53D7;&#x7CFB;&#x7EDF;&#x63A7;&#x5236;&#xFF1B;&#x800C;&#x534F;&#x7A0B;&#x4E5F;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#xFF0C;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x5207;&#x6362;&#x7531;&#x81EA;&#x5DF1;&#x63A7;&#x5236;&#xFF0C;&#x7531;&#x5F53;&#x524D;&#x534F;&#x7A0B;&#x5207;&#x6362;&#x5230;&#x5176;&#x4ED6;&#x534F;&#x7A0B;&#x7531;&#x5F53;&#x524D;&#x534F;&#x7A0B;&#x6765;&#x63A7;&#x5236;&#x3002;</p>
<p>&#x5DEE;&#x5F02;&#xFF1A;</p>
<p>&#x200B;    &#x8FDB;&#x7A0B;&#xFF1A;&#x62E5;&#x6709;&#x81EA;&#x5DF1;<strong>&#x72EC;&#x7ACB;</strong>&#x7684;&#x5806;&#x548C;&#x6808;&#xFF0C;&#x65E2;&#x4E0D;&#x5171;&#x4EAB;&#x5806;&#xFF0C;&#x4EA6;&#x4E0D;&#x5171;&#x4EAB;&#x6808;&#xFF0C;&#x8FDB;&#x7A0B;&#x7531;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8C03;&#x5EA6;&#x3002;&#x7EBF;&#x7A0B;&#xFF1A;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x72EC;&#x7ACB;&#x7684;&#x6808;&#x548C;&#x5171;&#x4EAB;&#x7684;&#x5806;&#xFF0C;&#x5171;&#x4EAB;&#x5806;&#xFF0C;&#x4E0D;&#x5171;&#x4EAB;&#x6808;&#xFF0C;&#x7EBF;&#x7A0B;&#x4EA6;&#x7531;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8C03;&#x5EA6;&#x3002;&#x534F;&#x7A0B; :&#x548C;&#x7EBF;&#x7A0B;&#x4E00;&#x6837;&#x5171;&#x4EAB;&#x5806;&#xFF0C;&#x4E0D;&#x5171;&#x4EAB;&#x6808;&#xFF0C;&#x534F;&#x7A0B;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x534F;&#x7A0B;&#x7684;&#x4EE3;&#x7801;&#x91CC;&#x663E;&#x793A;&#x8C03;&#x5EA6;&#x3002;</p>
<p>&#x6808;(stack)&#xFF1A;&#x7531;<strong>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;</strong>&#x81EA;&#x52A8;&#x5206;&#x914D;&#x91CA;&#x653E; &#xFF0C;&#x5B58;&#x653E;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x503C;&#xFF0C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x7B49;&#x3002;&#x5176;&#x64CD;&#x4F5C;&#x65B9;&#x5F0F;&#x7C7B;&#x4F3C;&#x4E8E;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x6808;&#x3002;&#x6808;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4E00;&#x7EA7;&#x7F13;&#x5B58;&#xFF0C; &#x4ED6;&#x4EEC;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x88AB;&#x8C03;&#x7528;&#x65F6;&#x5904;&#x4E8E;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x8C03;&#x7528;&#x5B8C;&#x6BD5;&#x7ACB;&#x5373;&#x91CA;&#x653E;&#x3002;&#x662F;&#x4E00;&#x79CD;&#x5148;&#x8FDB;&#x540E;&#x51FA;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x6808;&#x7684;&#x4F18;&#x52BF;&#x662F;&#xFF0C;&#x5B58;&#x53D6;&#x901F;&#x5EA6;&#x6BD4;&#x5806;&#x8981;&#x5FEB;&#xFF0C;&#x4EC5;&#x6B21;&#x4E8E;&#x76F4;&#x63A5;&#x4F4D;&#x4E8E;CPU&#x4E2D;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x3002;</p>
<p>&#x5806;(heap)&#xFF1A; &#x4E00;&#x822C;&#x7531;<strong>&#x7A0B;&#x5E8F;&#x5458;</strong>&#x5206;&#x914D;&#x91CA;&#x653E;&#xFF0C; &#x82E5;&#x7A0B;&#x5E8F;&#x5458;&#x4E0D;&#x91CA;&#x653E;&#xFF0C;&#x7A0B;&#x5E8F;&#x7ED3;&#x675F;&#x65F6;&#x53EF;&#x80FD;&#x7531;OS&#xFF08;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF09;&#x56DE;&#x6536;&#xFF0C;&#x5206;&#x914D;&#x65B9;&#x5F0F;&#x5012;&#x662F;&#x7C7B;&#x4F3C;&#x4E8E;&#x94FE;&#x8868;&#x3002;&#x5806;&#x5219;&#x662F;&#x5B58;&#x653E;&#x5728;&#x4E8C;&#x7EA7;&#x7F13;&#x5B58;&#x4E2D;&#xFF0C;&#x751F;&#x547D;&#x5468;&#x671F;&#x7531;&#x865A;&#x62DF;&#x673A;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x6765;&#x51B3;&#x5B9A;&#xFF08;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x65E6;&#x6210;&#x4E3A;&#x5B64;&#x513F;&#x5BF9;&#x8C61;&#x5C31;&#x80FD;&#x88AB;&#x56DE;&#x6536;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x8C03;&#x7528;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x7684;&#x901F;&#x5EA6;&#x8981;&#x76F8;&#x5BF9;&#x6765;&#x5F97;&#x4F4E;&#x4E00;&#x4E9B;&#x3002;&#x5806;&#x53EF;&#x4EE5;&#x88AB;&#x770B;&#x6210;&#x662F;&#x4E00;&#x68F5;&#x6811;&#xFF08;&#x6570;&#x636E;&#x7ED3;&#x6784;Tree&#xFF09;,&#x53EF;&#x4EE5;&#x52A8;&#x6001;&#x5730;&#x5206;&#x914D;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#xFF0C;&#x751F;&#x5B58;&#x671F;&#x4E5F;&#x4E0D;&#x5FC5;&#x4E8B;&#x5148;&#x544A;&#x8BC9;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x8981;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x52A8;&#x6001;&#x5206;&#x914D;&#x5185;&#x5B58;&#xFF0C;&#x6240;&#x4EE5;&#x5B58;&#x53D6;&#x901F;&#x5EA6;&#x8F83;&#x6162;&#xFF08;&#x5BF9;&#x6BD4;&#x6808;&#xFF09;&#x3002;</p>
</li>
<li><p>&#x8D44;&#x6E90;&#x8C03;&#x5EA6;</p>
</li>
</ul>
<h5 id="gmp">GMP</h5>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="README.md" class="navigation navigation-prev navigation-unique" aria-label="Previous page: golang">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"gmp模型","level":"1.3.1","depth":2,"previous":{"title":"golang","level":"1.3","depth":1,"path":"golang/README.md","ref":"./golang/README.md","articles":[{"title":"gmp模型","level":"1.3.1","depth":2,"path":"golang/gmp.md","ref":"./golang/gmp.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["-lunr","-search","search-pro","expandable-chapters-small","expandable-chapters","code","copy-code-button"],"pluginsConfig":{"search-pro":{},"code":{"copyButtons":true},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"expandable-chapters-small":{},"copy-code-button":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css"}},"file":{"path":"golang/gmp.md","mtime":"2022-11-05T07:17:31.742Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-11-05T08:16:39.919Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

